
6 1.emp table에서 이름의 첫 글자가 'K'보다 크고 'Y'보다 작은 사원의 정보를 사원번호, 이름, 업무
, 급여, 부서번호를 출력하고, 이름순으로 정렬하시오(단, SUBSTR()사용할 것)
7
8 2.emp table에서 이름 중 'L'자의 위치를 출력하시오
9
10 3.emp table에서 담당 업무 중 좌측에 'A'를 삭제하고 급여 중 좌측의 1을 삭제하여 출력하시오
11
12 4.emp table에서 이름, 입사일, 입사일로부터 6개월 후 돌아오는 월요일을 구하여 출력하시오.
13
14 5.emp table에서 모든 사원의 이름과 급여(15자리로 출력 좌측의 빈곳은 '*'로 대치)를 출력
하시오.
15
16 6.emp table에서 81년과 82년에 입사한 사원의 이름, 업무, 입사일, 입사한 요일을 출력하시오.
17
18 7. 급여가 $1,500부터 $3,000 사이의 사람은 급여의 15%를 회비로 지불하기로 하였다. 이를 이름,
급여, 회비(소수점 두 자리에서 반올림)를 출력하라.
19
20 8 급여가 $2,000 이상인 모든 사람은 급여의 15%를 경조비로 내기로 하였다. 이름, 급여, 경조비(
소수점 이하 절삭)를 출력하라.
21
22 9. 입사일부터 지금까지의 날짜수를 출력하라. 부서번호, 이름, 입사일, 현재일, 근무일수(소수점
이하 절삭), 근무년수, 근무월수(30일 기준), 근무주수를 출력하라.
23
24 10. 모든 사원의 실수령액을 계산하여 출력하라. 단, 급여가 많은 순으로 이름, 급여, 실수령액을
출력하라.(실수령액은 금여에 대해 10%의 세금을 뺀 금액)
25
26 11. 입사일로부터 90일이 지난 후의 사원이름, 입사일, 90일 후의 날, 급여를 출력하라.
27
28 12. 입사일로부터 6개월이 지난 후의 입사일, 6개월 후의 날짜, 급여를 출력하라
29
30 13. 입사한 달의 근무일수를 계산하여 부서번호, 이름, 근무일수를 출력하라.
31
32 14. 모든 사원의 60일이 지난 후의 ‘MONDAY’는 몇 년, 몇 월, 몇 일 인가를 구하여 이름, 입사일,’
MONDAY’를 출력하라
33
34 15. 입사일로부터 오늘까지의 일수를 구하여 이름, 입사일, 근무일수를 출력하라.
35
36 16. 입사일을 ‘2007년 3월 14일 수요일’의 형태로 이름, 입사일을 출력하라.
37
38 17. 이름의 글자수가 6자 이상인 사람의 이름을 앞에서 3자만 구하여 소문자로 이름만을 출력하
라.
39